Repository: wastedideas/telebot_world_hotels
Catalog: locales/*/LC_MESSAGES/chat_user_lang.po
Languages: ru

source: Hi, {username}! ✋ I am ready to select hotels according to your request! For command help, use */help* To select a language, use the command */en* or */ru*
ru: Привет, {username}! ✋ Я готов подобрать отели по Вашему запросу! Для помощи по командам используйте */help* Для выбора языка используйте команды */en* или */ru*

source: Language changed successfully!
ru: Язык успешно изменен!

source: */help* — help with commands */lowprice* — listing of the cheapest hotels in the city */highprice* — conclusion of the most expensive hotels in the city */bestdeal* — conclusion of hotels with the closest location from the center
ru: */help* — помощь по командам */lowprice* — вывод самых дешёвых отелей в городе */highprice* — вывод самых дорогих отелей в городе */bestdeal* — вывод отелей, с ближайшим расположением от центра

source: Enter the country to search for a hotel:
ru: Введите страну для поиска отеля:

source: Incorrect name. Enter the country name in Latin.
ru: Неверное название. Введите название страны на кириллице.

source: Enter the city to search for a hotel:
ru: Введите город для поиска отеля:

source: Checking the correctness of the city entry... ⚡
ru: Проверка корректности ввода города... ⚡

source: Enter the number of hotels you want to see (no more than 25):
ru: Введите количество отелей, которые хотите посмотреть (не более 25):

source: Invalid format. Please enter a quantity not exceeding 25.
ru: Неверный формат. Пожалуйста, введите количество не превышающее 25.

source: Enter the search start date (DD.MM.YYYY):
ru: Введите дату начала поиска (ДД.ММ.ГГГГ):

source: Invalid date format.
ru: Неверный фомрат даты.

source: Date does not exist or is not in the correct format. Date format: DD.MM.YYYY. Enter search start date:
ru: Даты не существует или неверный формат. Формат даты: ДД.ММ.ГГГГ Введите дату начала поиска:

source: Date does not exist or is not in the correct format. Date format: DD.MM.YYYY The end date of the search must be later than the start date. Enter the end date of the search:
ru: Даты не существует или неверный формат. Формат даты: ДД.ММ.ГГГГ Дата окончания поиска должна быть позже даты начала. Введите дату конца поиска:

source: Enter the end date of the search (DD.MM.YYYY):
ru: Введите дату конца поиска (ДД.ММ.ГГГГ):

source: Enter search price range in dollars (For example: "50-100"):
ru: Введите ценовой диапазон для поиска в рублях (Например: "5000-10000"):

source: Incorrect price. Please, enter price range in dollars again:
ru: Некорректная цена Пожалуйста, введите диапазон цен в рублях снова:

source: Searching for hotels. 🔍 It may take a few seconds ...
ru: Идет поиск отелей. 🔍 Это может занять несколько секунд...

source: No hotels found for your request.
ru: Не найдено отелей по Вашему запросу.

source: Not specified.
ru: Не указано.

source: No information.
ru: Нет информации.

source: {city_name} {country} {flag_for_tg} {list_item_emoji} Hotel name: {hotel_name} {list_item_emoji} Hotel address: {hotel_address} {list_item_emoji} Hotel rating: {hotel_rating} {list_item_emoji} Distance to the city center: {hotel_landmark}. {list_item_emoji} Cost of living: {hotel_price}
ru: {city_name} {country} {flag_for_tg} {list_item_emoji} Название отеля: {hotel_name} {list_item_emoji} Адрес отеля: {hotel_address} {list_item_emoji} Рейтинг отеля: {hotel_rating} {list_item_emoji} Расстояние до центра города: {hotel_landmark}. {list_item_emoji} Стоимость проживания (₽): {hotel_price}
